package com.company;

import java.text.ParseException;
import java.text.SimpleDateFormat;
import java.util.*;


public class Main {


    public static void main(String[] args) throws InterruptedException, ParseException {
        // write your code here

        String animTime = "2016-08-01 21:00:00";
        System.out.println("例子如下:");
        System.out.println(animTime);
        Scanner scanner = new Scanner(System.in);
        while (scanner.hasNext()) {
            animTime = scanner.nextLine().trim();
            Init.init();
            ArrayList<HashMap<String, String>> userList = Init.getUserList();
            String[] GoodsList = {
                    "df2784959044219751,df160718p2784959,1",
                    "df2784958022795941,df160718p2784958,1",
                    "df2782873031493096,df160718p2782873,1",
                    /*75A文胸:*/"df2812161176091691,df160714p2812161,1",
                    /*75B文胸:*/"df2812161210450873,df160714p2812161,1",
                    /*70B文胸+配裤:*/"df2814640083696521,df160714p2814640,1",
                    /*75B文胸+配裤:*/"df2814640139392068,df160714p2814640,1",
                    /*裸婚时代*120:*/"df17513971916156241,df160714p590168,1",
                    /*蒙奇奇*120:*/"df17513971916157549,df160714p590168,1",
                    /*红色:*/"df138114538650889410,df160715p2299377,1",
                    /*黑色:*/"df138114538650886477,df160715p2299377,1",
                    /*灰色:*/"df138114538650887315,df160715p2299377,1",
                    /*黄色:*/"df14613988250288810,df160716p641655,1",
                    /*黑色:*/"df14613988250286218,df160716p641655,1",
                    /*QGN2057压花纹玫红:*/"df26614518974363775,df160714p2237482,1",
                    /*QGN2057压花纹蓝色:*/"df26614518974367838,df160714p2237482,1",
                    /*华盛顿白:*/"df45114346136595273,df160715p1654518,1",
                    /*墨尔本黑:*/"df45114346136594109,df160715p1654518,1",
                    /*多瑙河蓝:*/"df45114541284981686,df160715p1654518,1",
                    /*威尼斯咖啡:*/"df45114541284996348,df160715p1654518,1",
                    /*bao1:*/"df89814538721527195,df160715p2300043,1",
                    /*白色:*/"df89814538721522729,df160715p2300043,1",
                    /*bao2:*/"df89814538721526441,df160715p2300043,1",
                    /*bao3:*/"df89814538721523074,df160715p2300043,1",
                    /*bao4黑:*/"df2300043488762020,df160715p2300043,1",
                    /*bao5:*/"df2300043530906354,df160715p2300043,1",
                    /*bao6灰:*/"df2300043620539116,df160715p2300043,1",
                    /*bao6绿:*/"df2300043715783707,df160715p2300043,1",
                    /*bao7:*/"df2300043886338726,df160715p2300043,1",
                    /*bao8:*/"df2300043971490525,df160715p2300043,1",
                    /*bao9:*/"df23000431090856492,df160715p2300043,1",
                    /*bao10:*/"df23000431123032769,df160715p2300043,1",
                    /*bao11蓝:*/"df23000431217597886,df160715p2300043,1",
                    /*bao11黑:*/"df23000431327511613,df160715p2300043,1",
                    /*bao11紫:*/"df23000431451363766,df160715p2300043,1",
                    /*bao12:*/"df23000431564477947,df160715p2300043,1",
                    /*bao13:*/"df23000431616655941,df160715p2300043,1",
                    /*bao14:*/"df23000431791542705,df160715p2300043,1",
                    /*bao15:*/"df23000431899138181,df160715p2300043,1",
                    /*bao16:*/"df23000431951460526,df160715p2300043,1",
                    /*bao17:*/"df23000432081443837,df160715p2300043,1",
                    /*bao18:*/"df23000432177898601,df160715p2300043,1",
                    /*bao19:*/"df23000432237885524,df160715p2300043,1",
            };
//        HashMap<String, String> stringStringHashMap = userList.get(0);
            for (int i = 0; i < userList.size(); i++) {
                new AddCartThread(animTime, GoodsList, userList.get(i)).run();
            }
        }

    }
}
